# AreCurveLoopsValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaLoad..::..AreCurveLoopsValid Method
AreaLoad Class See Also
---
Checks if curve loops are valid for creating an area load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static bool AreCurveLoopsValid(
	IList<CurveLoop> loops
)
```

Visual Basic
---
```text
Public Shared Function AreCurveLoopsValid ( _
	loops As IList(Of CurveLoop) _
) As Boolean
```

Visual C++
---
```text
public:
static bool AreCurveLoopsValid(
	IList<CurveLoop^>^ loops
)
```

# ### Parameters
loops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)> The curve loops to be checked.
# ### Return Value
Returns true if curve loops are ok, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace